In [1]:
import pandas as pd
import os
import matplotlib as plt
import csv

In [2]:
#Load the files
schoolfile = os.path.join('Resources/schools_complete.csv')
studentfile = os.path.join('Resources/students_complete.csv')

In [3]:
# Read
school_df= pd.read_csv(schoolfile)
student_df = pd.read_csv(studentfile)

In [4]:
# Understand what column titles we have in the files 
school_df.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [5]:
student_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score'],
      dtype='object')

In [33]:
#merge the files and combine the columns we need in the new DF

combined_df = pd.merge(school_df, student_df, how='left', on=['school_name','school_name'])
combined_df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [7]:
combined_df.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget', 'Student ID',
       'student_name', 'gender', 'grade', 'reading_score', 'math_score'],
      dtype='object')

In [8]:
#Count schools
school_count = combined_df['School ID'].unique().size
school_count

15

In [9]:
#Total Students
total_studs = combined_df['Student ID'].unique().size
total_studs

39170

In [10]:
#Total Budget
total_budget = school_df['budget'].sum()
print(f"The total Budget is ${total_budget:,}")

The total Budget is $24,649,428

In [11]:
#AVG math score
avg_mscore = combined_df['math_score'].mean()
print(f"The average math score is {avg_mscore:.2f}%")

The average math score is 78.99%

In [12]:
#AVG reading score
avg_rscore = combined_df['reading_score'].mean()
print(f"The average reading score is {avg_rscore:.2f}%")

The average reading score is 81.88%

In [104]:
#Passing Math scores
passing_math = (combined_df["math_score"] >= 70).sum()
print(f" the amount of passing scores in math is {passing_math:,}")

 the amount of passing scores in math is 29,370

In [102]:
#Passing Reading Scores
passing_reading = (combined_df["reading_score"] >=70).sum()
print(f" the amount of passing scores in reading is {passing_reading:,}")

 the amount of passing scores in reading is 33,610

In [15]:
#Passing both math and reading pt 1
combined_pass = ((combined_df["math_score"] >= 70) & (combined_df["reading_score"] >= 70)).sum() / len(combined_df) * 100
print(f" the percentage amount of passing both math and reading is {combined_pass:.2f}%")

 the percentage amount of passing both math and reading is 65.17%

In [16]:
#District Summary analysis
#column headers
district_h= ["School count" , "Total Students", "Total Budget", "Average Math Score",
             "Average Reading Score", "% Passing Math", "% Passing reading",
             "Combined Passing Percentage"]
#dataframe of summary
district_s = [f"{school_count}",f"{total_studs:,}",f"${total_budget:,.2f}",
            f"{avg_mscore:.2f}%",f"{avg_rscore:.2f}%", f"{passing_math:.2f}%",
            f"{passing_reading:.2f}%",f"{combined_pass:.2f}%"]

#combined headers and summary
d_table = pd.DataFrame([district_s], columns = district_h)

d_table.style.hide(axis='index').set_caption("District Summary")

# School Analysis

In [17]:
schools= school_df.set_index(['school_name'])['type']
schools

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [18]:
#Students total by school
students_per_school = combined_df.groupby('school_name')['Student ID'].count().reset_index()
students_per_school

              school_name  Student ID
0      Bailey High School        4976
1     Cabrera High School        1858
2    Figueroa High School        2949
3        Ford High School        2739
4     Griffin High School        1468
5   Hernandez High School        4635
6      Holden High School         427
7       Huang High School        2917
8     Johnson High School        4761
9        Pena High School         962
10  Rodriguez High School        3999
11    Shelton High School        1761
12     Thomas High School        1635
13     Wilson High School        2283
14     Wright High School        1800

In [19]:
budget_per_school = combined_df.groupby(["school_name"]).mean()["budget"]
budget_per_school

school_name
Bailey High School       3124928.0
Cabrera High School      1081356.0
Figueroa High School     1884411.0
Ford High School         1763916.0
Griffin High School       917500.0
Hernandez High School    3022020.0
Holden High School        248087.0
Huang High School        1910635.0
Johnson High School      3094650.0
Pena High School          585858.0
Rodriguez High School    2547363.0
Shelton High School      1056600.0
Thomas High School       1043130.0
Wilson High School       1319574.0
Wright High School       1049400.0
Name: budget, dtype: float64

In [26]:
# Calculate the total school budget and per capita spending
budget_per_cap = combined_df.groupby(["school_name"]).mean()["budget"] / combined_df.groupby(["school_name"]).count()["Student ID"]
budget_per_cap = budget_per_cap.rename("Per Capita Spending")
budget_per_cap = budget_per_cap.map("${:.2f}".format)
budget_per_cap = budget_per_cap.to_frame().reset_index()
budget_per_cap.style.hide_index().set_caption("Budget per Capita Spending")

/var/folders/hz/bjhjcnjd4qn3q0j3_msfw5xc0000gn/T/ipykernel_62620/3684922809.py:6: FutureWarning: this method is deprecated in favour of `Styler.hide(axis='index')`
  budget_per_cap.style.hide_index().set_caption("Budget per Capita Spending")

In [60]:
# Calculate the average test scores
per_school_math = combined_df.groupby(['school_name']).mean()['math_score']
per_school_reading = combined_df.groupby(['school_name']).mean()['reading_score']
per_school_score = pd.DataFrame({'Average Math Score': per_school_math, 'Average Reading Score': per_school_reading})
per_school_score

                       Average Math Score  Average Reading Score
school_name
Bailey High School              77.048432              81.033963
Cabrera High School             83.061895              83.975780
Figueroa High School            76.711767              81.158020
Ford High School                77.102592              80.746258
Griffin High School             83.351499              83.816757
Hernandez High School           77.289752              80.934412
Holden High School              83.803279              83.814988
Huang High School               76.629414              81.182722
Johnson High School             77.072464              80.966394
Pena High School                83.839917              84.044699
Rodriguez High School           76.842711              80.744686
Shelton High School             83.359455              83.725724
Thomas High School              83.418349              83.848930
Wilson High School              83.274201              83.989488
Wright High School              83.682222              83.955000

In [75]:
# Calculate the number of schools with math scores of 70 or higher
per_s_math_pass = combined_df[combined_df['math_score'] >= 70]
school_passing_math = per_s_math_pass.groupby('school_name')['school_name'].nunique().count()
school_passing_math

15

In [57]:
# Calculate the number of schools with reading scores of 70 or higher
school_passing_reading = combined_df[combined_df['math_score'] >= 70]
school_passing_reading.count()

15

In [99]:
#calculate the schools that passed both math and reading with scores of 70 or higher
schools_passing_both = combined_df[
    (combined_df["reading_score"] >= 70) & (combined_df["math_score"] >= 70)]

School ID        25528
school_name      25528
type             25528
size             25528
budget           25528
Student ID       25528
student_name     25528
gender           25528
grade            25528
reading_score    25528
math_score       25528
dtype: int64

AttributeError: 'int' object has no attribute 'count'